/*
ООП 
Перегружені конструктори. this

old
Розробити клас String, який в подальшому буде використовуватися для роботи з рядками. Клас повинен містити:
конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
конструктор, що дозволяє створювати рядок довільного розміру;
конструктор, який створює рядок і ініціалізує її рядком, отриманої від користувача.
Клас повинен містити методи для введення рядків з клавіатури і виведення рядків на екран. 

new
Розробити клас StringRow, який в подальшому буде використовуватися для роботи з рядками. Клас повинен містити:
конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
конструктор, що дозволяє створювати рядок довільного розміру;
конструктор, який створює об'єкт і ініціалізує його рядком, отриманим від користувача.
Клас повинен містити методи для введення рядків з клавіатури і виведення рядків на екран.
*/

using System;

namespace ex304
{
    internal class Program
    {
        static void Main(string[] args)
        {
            StringRow s1 = new StringRow(); //конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів
            StringRow.WriteLine(s1.ToString().Length.ToString()); //перевірка довжини рядка створенного об"єкту 
            StringRow s2 = new StringRow(120); //конструктор, що дозволяє створювати рядок довільного розміру;
            StringRow.WriteLine(s2.ToString().Length.ToString()); ////перевірка довжини рядка створенного об"єкту
            StringRow s3 = new StringRow("Hello World"); //конструктор, який створює об'єкт і ініціалізує його рядком, отриманим від користувача.
            StringRow.WriteLine(s3.ToString()); // метод для виведення рядків на екран
            StringRow.Write("Intput string from console : ");
            StringRow s4 = new StringRow(StringRow.ReadLine()); //створення об"єтку на основі метода для введення рядків з клавіатури
            StringRow.WriteLine(s4.ToString()); // метод для виведення рядків на екран
            StringRow.ReadKey();
        }
    }
}
