/*
ООП 
Перегружені конструктори. this

Розробити клас String, який в подальшому буде використовуватися для роботи з рядками. Клас повинен містити:
конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
конструктор, що дозволяє створювати рядок довільного розміру;
конструктор, який створює рядок і ініціалізує її рядком, отриманої від користувача.
Клас повинен містити методи для введення рядків з клавіатури і виведення рядків на екран. 
*/

using System;

namespace ex304
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
