using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EX_222___226
{



    class Program
    {
       

        static void EX_222()
        {
            var exercise = new EX_222();//Написати перевантажені функції для знаходження коренів лінійного (a * x + b = 0) і квадратного (a * x2 + b * x + c = 0) рівнянь. Зауваження: у функції передаються коефіцієнти рівнянь.
            exercise.main();
        }
        static void EX_224()
        {
            var exercise = new EX_224();//Написати перевантажені функції для знаходження коренів лінійного (a * x + b = 0) і квадратного (a * x2 + b * x + c = 0) рівнянь. Зауваження: у функції передаються коефіцієнти рівнянь.
            exercise.main();
        }
        static void EX_226()
        {
            var exercise = new EX_226();//Написати перевантажені функції для знаходження коренів лінійного (a * x + b = 0) і квадратного (a * x2 + b * x + c = 0) рівнянь. Зауваження: у функції передаються коефіцієнти рівнянь.
            exercise.main();
        }
    
    static void Main(string[] args)
        {
            //EX_222();//Написати перевантажені функції для знаходження коренів лінійного (a * x + b = 0) і квадратного (a * x2 + b * x + c = 0) рівнянь. Зауваження: у функції передаються коефіцієнти рівнянь.
            //EX_224();//Дано масив випадкових чисел в діапазоні від -20 до +20. Необхідно знайти позиції крайніх негативних елементів (самого лівого негативного елементу і самого правого негативного елементу) і впорядкувати елементи, що знаходяться між ними.
            EX_226();//Написати функцію, яка сортує масив розмірністю 10 елементів за зростанням або за спаданням, в залежності від третього параметра функції. Якщо він дорівнює 1, сортування йде за спаданням, якщо 0, то по зростанню. Перші 2 параметра функції - це масив і його розмір, третій параметр за замовчуванням дорівнює 1.

        }
    }
}
