/*
ООП
Класи і конструктори

КОМАНДРА РОБОТА: розробити кілька пов'язаних класів, які можуть між собою взаємодіяти; в програмі реалізувати ініціалізацію і взаємодію об'єктів розроблених класів;
кожен член команди має розробити принаймні один клас; бажаною є наявність ієрархієї класів (якщо вдасться, то взаємодію класів організуйте через інтерфейси*)
*/

using System;

namespace ex300
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
